import os 
from pyperclip import copy as cp
from art import tprint

import colorama
from colorama import Fore, Back, Style
colorama.init(autoreset=True)



def MorzeCode(message:str,lang ='ru',mode:bool =True,final=""):
    '''Функция Кодирования/Декодирования Азбуки Морзе
    1.Первый Параметр-Сообщение
    2.Второй Параметр-Язык,зависит от языка сообщения(по умолчанию русский)
    3.Третий Параметр-Переключатель Кодирования/Декодирования(по умолчания Кодирования(True) )
    Внимание!Защифрованое Сообщение копируется в буфер Обмена(Для удобства)
    Внимание!В функции использован Код для Символа 'Ё' = '-.-.-' отличается
                                     от других кодов, там 'Ё' ='Е'='.'
    Функция возвращает два Параметра(Сообщение и Значения Параметра <lang> )'''

    os.system("cls")
    tprint("MorzeCode",font="rnd-medium")

    #===================Русские коды Морзе
    rus_codes ={'А':'.-','Б':'-...','В':'.--','Г':'--.','Д':'-..','Е':'.','Ё':'-.-.-','Ж':'...-','З':'--..',
    'И':'..','Й':'.---','К':'-.-','Л':'.-..','М':'--','Н':'-.','О':'---','П':'.--.','Р':'.-.','С':'...',
    'Т':'-','У':'..-','Ф':'..-.','Х':'....','Ц':'-.-.','Ч':'---.','Ш':'----','Щ':'--.-','Ъ':'.--.-.',
    'Ы':'-.--','Ь':'-..-','Э':'..-..','Ю':'..--','Я':'.-.-',' ':'.......','1':'.----','2':'..---',
    '3':'...--','4':'....-','5':'.....','6':'-....','7':'--...','8':'---..','9':'----.','0':'-----',
    '.':'......',',':'.-.-.-','!':'--..--','-':'-....-','?':'..--..'}

    #==================Английские коды Морзе
    eng_codes ={'A':'.-','B':'-...','C':'-.-.','D':'-..','E':'.','F':'..-.','G':'--.',
    'H':'....','I':'..','J':'.---','K':'-.-','L':'.-..','M':'--','N':'-.','O':'---','P':'.--.',
    'Q':'--.-','R':'.-.','S':'...','T':'-','U':'..-','V':'...-','W':'.--','X':'-..-',
    'Y':'-.--','Z':'--..',' ':'.......','1':'.----','2':'..---','3':'...--','4':'....-',
    '5':'.....','6':'-....','7':'--...','8':'---..','9':'----.','0':'-----',
    '.':'......',',':'.-.-.-','!':'--..--','-':'-....-','?':'..--..'}

    #==================Выбор <кодов Морзе> в Зависимости от Парметра lang(Второй Параметр)
    codes =rus_codes if lang =='ru' else eng_codes
    #=====================Точка Входа  функции
    try:
        #==========================Кодирования
        if mode:
            for sym in message.upper():
                if sym not in codes:message = message.replace(sym, ' ')
            for sym in message.upper():final += codes[sym] + ' '
            
        #==========================Декодирования    
        else:
            for code in message.split():
                for sym  in codes:
                    if code ==codes[sym]:final +=sym
                  
        cp(final)
        print(f"\n\tАзбука Морзе:{Fore.CYAN}{final}")
        return final,lang

    except Exception as e:print(e)   

rus_str ='Ну,начнём! Дойдя до конца нашей истории.Хорошо?'
eng_str ='Yes, Dr. Sumpler! She had come to enjoy the acrid half hour.OK?'
msg="-.-- . ... .-.-.- ....... -.. .-. ...... ....... ... ..- -- .--. .-.. . .-. --..-- ....... ... .... . ....... .... .- -.. ....... -.-. --- -- . ....... - --- ....... . -. .--- --- -.-- ....... - .... . ....... .- -.-. .-. .. -.. ....... .... .- .-.. ..-. ....... .... --- ..- .-. ...... --- -.- ..--.. "

MorzeCode(msg,lang="eng",mode =0) 
